zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/startup_MIMXRT2660.c
    dst = __dataext_bss_start__;
    while (dst < __dataext_bss_end__)    *dst++ = 0U;
}

#define WEAK_AV                 __attribute__((weak))

#if defined(DEBUG)
#define STARTUP_PRAGMA_PUSH      _Pragma("GCC push_options") _Pragma("GCC optimize(\"Og\")")
#define STARTUP_PRAGMA_POP       _Pragma("GCC pop_options")
#else
#define STARTUP_PRAGMA_PUSH
#define STARTUP_PRAGMA_POP
#endif

#define STARTUP_RESET_ATTR      __attribute__((naked, used, section(".text.startup")))
#define STARTUP_RESET_C_ATTR    __attribute__((used, noinline, section(".text.startup")))

#define STARTUP_VT_SECTION      __attribute__((used, section(".isr_vector")))
#define STARTUP_VT_SYMBOL       __isr_vector

#define _vStackTop              __StackTop
#define _vStackBase             __StackLimit

#define STARTUP_RUNTIME_PROLOG()   do { \
    toolchain_manual_init(); \
} while (0)
#define STARTUP_RUNTIME_ENTER()    do { \
    __asm volatile("cpsie i"); \
    _start(); \
} while (0)


#else
#error "Unsupported toolchain"
#endif

STARTUP_PRAGMA_PUSH

//*****************************************************************************
// Section 2: Common macros
//*****************************************************************************

#define WEAK            __attribute__((weak))
#define ALIAS(target)   __attribute__((weak, alias(#target)))

//*****************************************************************************
// Section 3: Common declarations
//*****************************************************************************

extern void SystemInit(void);

STARTUP_RESET_ATTR   void Reset_Handler(void);
STARTUP_RESET_C_ATTR void Reset_Handler_C(void);

//*****************************************************************************
// Section 4: IRQ function declarations
//*****************************************************************************
WEAK_AV void NMI_Handler(void);
WEAK_AV void HardFault_Handler(void);
WEAK_AV void MemManage_Handler(void);
WEAK_AV void BusFault_Handler(void);
WEAK_AV void UsageFault_Handler(void);
WEAK_AV void SVC_Handler(void);
WEAK_AV void DebugMon_Handler(void);
WEAK_AV void PendSV_Handler(void);
WEAK_AV void SysTick_Handler(void);
WEAK_AV void DefaultISR(void);
WEAK_AV void DefaultISR2(uint32_t instance, uint32_t channel);
WEAK_AV void DefaultISR1(uint32_t instance);

WEAK void CMPT_CM85_CTI_IRQHandler(void);
WEAK void Reserved17_IRQHandler(void);
WEAK void Reserved18_IRQHandler(void);
WEAK void CMPT_CM85_ECC_ERROR_IRQHandler(void);
WEAK void Reserved20_IRQHandler(void);
WEAK void Reserved21_IRQHandler(void);
WEAK void CMPT_CM85_MCM_IRQHandler(void);
WEAK void CMPT_TRDC_IRQHandler(void);
WEAK void Reserved24_IRQHandler(void);
WEAK void CMPT_SRAMCTL_0_IRQHandler(void);
WEAK void CMPT_SRAMCTL_1_IRQHandler(void);
WEAK void CMPT_SRAMCTL_2_IRQHandler(void);
WEAK void Reserved28_IRQHandler(void);
WEAK void Reserved29_IRQHandler(void);
WEAK void Reserved30_IRQHandler(void);
WEAK void Reserved31_IRQHandler(void);
WEAK void CMPT_FREQME_IRQHandler(void);
WEAK void Reserved33_IRQHandler(void);
WEAK void Reserved34_IRQHandler(void);
WEAK void Reserved35_IRQHandler(void);
WEAK void CMPT_LLC_IRQHandler(void);
WEAK void Reserved37_IRQHandler(void);
WEAK void Reserved38_IRQHandler(void);
WEAK void Reserved39_IRQHandler(void);
WEAK void CMPT_DAP_IRQHandler(void);
WEAK void MAIN_TRDC_IRQHandler(void);
WEAK void MAIN_AHB2AXI_IRQHandler(void);
WEAK void Reserved43_IRQHandler(void);
WEAK void MAIN_MMU_IRQHandler(void);
WEAK void MAIN_EDMA3_CH0_IRQHandler(void);
WEAK void MAIN_EDMA3_CH1_IRQHandler(void);
WEAK void MAIN_EDMA3_CH2_IRQHandler(void);
WEAK void MAIN_EDMA3_CH3_IRQHandler(void);
WEAK void MAIN_EDMA3_CH4_IRQHandler(void);
WEAK void MAIN_EDMA3_CH5_IRQHandler(void);
WEAK void MAIN_EDMA3_CH6_IRQHandler(void);
WEAK void MAIN_EDMA3_CH7_IRQHandler(void);
WEAK void MAIN_EDMA3_CH8_IRQHandler(void);
WEAK void MAIN_EDMA3_CH9_IRQHandler(void);
WEAK void MAIN_EDMA3_CH10_IRQHandler(void);
WEAK void MAIN_EDMA3_CH11_IRQHandler(void);
WEAK void MAIN_EDMA3_CH12_IRQHandler(void);
WEAK void MAIN_EDMA3_CH13_IRQHandler(void);
WEAK void MAIN_EDMA3_CH14_IRQHandler(void);
WEAK void MAIN_EDMA3_CH15_IRQHandler(void);
WEAK void MAIN_EDMA3_CH16_IRQHandler(void);
WEAK void MAIN_EDMA3_CH17_IRQHandler(void);
WEAK void MAIN_EDMA3_CH18_IRQHandler(void);
WEAK void MAIN_EDMA3_CH19_IRQHandler(void);
WEAK void MAIN_EDMA3_CH20_IRQHandler(void);
WEAK void MAIN_EDMA3_CH21_IRQHandler(void);
WEAK void MAIN_EDMA3_CH22_IRQHandler(void);
WEAK void MAIN_EDMA3_CH23_IRQHandler(void);
WEAK void MAIN_EDMA3_CH24_IRQHandler(void);
WEAK void MAIN_EDMA3_CH25_IRQHandler(void);
WEAK void MAIN_EDMA3_CH26_IRQHandler(void);
WEAK void MAIN_EDMA3_CH27_IRQHandler(void);
WEAK void MAIN_EDMA3_CH28_IRQHandler(void);
WEAK void MAIN_EDMA3_CH29_IRQHandler(void);
WEAK void MAIN_EDMA3_CH30_IRQHandler(void);
WEAK void MAIN_EDMA3_CH31_IRQHandler(void);
WEAK void MAIN_EDMA5_CH0_IRQHandler(void);
WEAK void MAIN_EDMA5_CH1_IRQHandler(void);
WEAK void MAIN_EDMA5_CH2_IRQHandler(void);
WEAK void MAIN_EDMA5_CH3_IRQHandler(void);
WEAK void MAIN_EDMA5_CH4_IRQHandler(void);
WEAK void MAIN_EDMA5_CH5_IRQHandler(void);
WEAK void MAIN_EDMA5_CH6_IRQHandler(void);
WEAK void MAIN_EDMA5_CH7_IRQHandler(void);
WEAK void MAIN_EDMA5_CH8_IRQHandler(void);
WEAK void MAIN_EDMA5_CH9_IRQHandler(void);
WEAK void MAIN_EDMA5_CH10_IRQHandler(void);
WEAK void MAIN_EDMA5_CH11_IRQHandler(void);
WEAK void MAIN_EDMA5_CH12_IRQHandler(void);
WEAK void MAIN_EDMA5_CH13_IRQHandler(void);
WEAK void MAIN_EDMA5_CH14_IRQHandler(void);
WEAK void MAIN_EDMA5_CH15_IRQHandler(void);
WEAK void MAIN_FREQME_IRQHandler(void);
WEAK void HSP_STM_IRQHandler(void);
WEAK void Reserved95_IRQHandler(void);
WEAK void Reserved96_IRQHandler(void);
WEAK void Reserved97_IRQHandler(void);
WEAK void MAIN_XSPI0_IRQHandler(void);
WEAK void MAIN_XSPI1_IRQHandler(void);
WEAK void Reserved100_IRQHandler(void);
WEAK void Reserved101_IRQHandler(void);
WEAK void SYSCON_CGU_INT0_IRQHandler(void);
WEAK void SYSCON_CGU_INT1_IRQHandler(void);
WEAK void SYSCON_CGU_INT2_IRQHandler(void);
WEAK void MAIN_CSSI_IRQHandler(void);
WEAK void MAIN_CSSI_SENTMU0A_IRQHandler(void);
WEAK void MAIN_CSSI_SENTMU1A_IRQHandler(void);
WEAK void Reserved108_IRQHandler(void);
WEAK void SYSCON_PMU_INT0_IRQHandler(void);
WEAK void SYSCON_PMU_INT1_IRQHandler(void);
WEAK void SYSCON_RESETCON_IRQHandler(void);
WEAK void SYSCON_FREQME_IRQHandler(void);
WEAK void Reserved113_IRQHandler(void);
WEAK void Reserved114_IRQHandler(void);
WEAK void Reserved115_IRQHandler(void);
WEAK void HSP_XBAR0_CH0_IRQHandler(void);
WEAK void HSP_XBAR0_CH1_IRQHandler(void);
WEAK void HSP_XBAR0_CH2_IRQHandler(void);
WEAK void HSP_XBAR0_CH3_IRQHandler(void);
WEAK void HSP_XBAR0_CH4_IRQHandler(void);
WEAK void HSP_XBAR0_CH5_IRQHandler(void);
WEAK void HSP_XBAR0_CH6_IRQHandler(void);
WEAK void HSP_XBAR0_CH7_IRQHandler(void);
WEAK void Reserved124_IRQHandler(void);
WEAK void Reserved125_IRQHandler(void);
WEAK void Reserved126_IRQHandler(void);
WEAK void Reserved127_IRQHandler(void);
WEAK void HSP_ADC0_IRQHandler(void);
WEAK void HSP_ADC1_IRQHandler(void);
WEAK void HSP_DAC_IRQHandler(void);
WEAK void HSP_LPIT0_IRQHandler(void);
WEAK void HSP_LPIT1_IRQHandler(void);
WEAK void HSP_EFLEXPWM0_CH0_IRQHandler(void);
WEAK void HSP_EFLEXPWM0_CH1_IRQHandler(void);
WEAK void HSP_EFLEXPWM0_CH2_IRQHandler(void);
WEAK void HSP_EFLEXPWM0_CH3_IRQHandler(void);
WEAK void HSP_EFLEXPWM0_ERROR_IRQHandler(void);
WEAK void HSP_EFLEXPWM1_CH0_IRQHandler(void);
WEAK void HSP_EFLEXPWM1_CH1_IRQHandler(void);
WEAK void HSP_EFLEXPWM1_CH2_IRQHandler(void);
WEAK void HSP_EFLEXPWM1_CH3_IRQHandler(void);
WEAK void HSP_EFLEXPWM1_ERROR_IRQHandler(void);
WEAK void HSP_EFLEXPWM2_CH0_IRQHandler(void);
WEAK void HSP_EFLEXPWM2_CH1_IRQHandler(void);
WEAK void HSP_EFLEXPWM2_CH2_IRQHandler(void);
WEAK void HSP_EFLEXPWM2_CH3_IRQHandler(void);
WEAK void HSP_EFLEXPWM2_ERROR_IRQHandler(void);
WEAK void HSP_EFLEXPWM3_CH0_IRQHandler(void);
WEAK void HSP_EFLEXPWM3_CH1_IRQHandler(void);
WEAK void HSP_EFLEXPWM3_CH2_IRQHandler(void);
WEAK void HSP_EFLEXPWM3_CH3_IRQHandler(void);
WEAK void HSP_EFLEXPWM3_ERROR_IRQHandler(void);
WEAK void HSP_QTPM0_IRQHandler(void);
WEAK void HSP_QTPM1_IRQHandler(void);
WEAK void HSP_QTPM2_IRQHandler(void);
WEAK void HSP_QTPM3_IRQHandler(void);
WEAK void Reserved157_IRQHandler(void);
WEAK void Reserved158_IRQHandler(void);
WEAK void Reserved159_IRQHandler(void);
WEAK void Reserved160_IRQHandler(void);
WEAK void Reserved161_IRQHandler(void);
WEAK void Reserved162_IRQHandler(void);
WEAK void Reserved163_IRQHandler(void);
WEAK void Reserved164_IRQHandler(void);
WEAK void HSP_QTMR0_IRQHandler(void);
WEAK void HSP_QTMR1_IRQHandler(void);
WEAK void HSP_QTMR2_IRQHandler(void);
WEAK void HSP_QTMR3_IRQHandler(void);
WEAK void HSP_EQDC0_IRQHandler(void);
WEAK void HSP_EQDC1_IRQHandler(void);
WEAK void HSP_EQDC2_IRQHandler(void);
WEAK void HSP_EQDC3_IRQHandler(void);
WEAK void HSP_SINC0_CH0_IRQHandler(void);
WEAK void HSP_SINC0_CH1_IRQHandler(void);
WEAK void HSP_SINC0_CH2_IRQHandler(void);
WEAK void HSP_SINC0_CH3_IRQHandler(void);
WEAK void HSP_SINC1_CH0_IRQHandler(void);
WEAK void HSP_SINC1_CH1_IRQHandler(void);
WEAK void HSP_SINC1_CH2_IRQHandler(void);
WEAK void HSP_SINC1_CH3_IRQHandler(void);
WEAK void HSP_FLEXCAN0_IRQHandler(void);
WEAK void HSP_FLEXCAN0_ERROR_IRQHandler(void);
WEAK void HSP_FLEXCAN1_IRQHandler(void);
WEAK void HSP_FLEXCAN1_ERROR_IRQHandler(void);
WEAK void HSP_FLEXCAN2_IRQHandler(void);
WEAK void HSP_FLEXCAN2_ERROR_IRQHandler(void);
WEAK void HSP_FLEXIO0_IRQHandler(void);
WEAK void HSP_FLEXIO1_IRQHandler(void);
WEAK void HSP_FLEXIO2_IRQHandler(void);
WEAK void HSP_I3C_IRQHandler(void);
WEAK void HSP_LPI2C0_IRQHandler(void);
WEAK void HSP_LPI2C1_IRQHandler(void);
WEAK void Reserved193_IRQHandler(void);
WEAK void Reserved194_IRQHandler(void);
WEAK void HSP_LPSPI0_IRQHandler(void);
WEAK void HSP_LPSPI1_IRQHandler(void);
WEAK void HSP_LPSPI2_IRQHandler(void);
WEAK void HSP_LPSPI3_IRQHandler(void);
WEAK void HSP_LPSPI4_IRQHandler(void);
WEAK void HSP_LPUART0_IRQHandler(void);
WEAK void HSP_LPUART1_IRQHandler(void);
WEAK void HSP_LPUART2_IRQHandler(void);
WEAK void HSP_LPUART3_IRQHandler(void);
WEAK void HSP_LPUART4_IRQHandler(void);
WEAK void HSP_LPUART5_IRQHandler(void);
WEAK void HSP_GPIO0_CH0_IRQHandler(void);
WEAK void HSP_GPIO0_CH1_IRQHandler(void);
WEAK void HSP_GPIO1_CH0_IRQHandler(void);
WEAK void HSP_GPIO1_CH1_IRQHandler(void);
WEAK void HSP_GPIO2_CH0_IRQHandler(void);
WEAK void HSP_GPIO2_CH1_IRQHandler(void);
WEAK void HSP_GPIO3_CH0_IRQHandler(void);
WEAK void HSP_GPIO3_CH1_IRQHandler(void);
WEAK void HSP_GPIO4_CH0_IRQHandler(void);
WEAK void HSP_GPIO4_CH1_IRQHandler(void);
WEAK void Reserved216_IRQHandler(void);
WEAK void Reserved217_IRQHandler(void);
WEAK void Reserved218_IRQHandler(void);
WEAK void Reserved219_IRQHandler(void);
WEAK void Reserved220_IRQHandler(void);
WEAK void WAKE_TRDC_IRQHandler(void);
WEAK void WAKE_XBAR_CH0_IRQHandler(void);
WEAK void WAKE_XBAR_CH1_IRQHandler(void);
WEAK void WAKE_EDMA3_CH0_IRQHandler(void);
WEAK void WAKE_EDMA3_CH1_IRQHandler(void);
WEAK void WAKE_EDMA3_CH2_IRQHandler(void);
WEAK void WAKE_EDMA3_CH3_IRQHandler(void);
WEAK void WAKE_EDMA3_CH4_IRQHandler(void);
WEAK void WAKE_EDMA3_CH5_IRQHandler(void);
WEAK void WAKE_EDMA3_CH6_IRQHandler(void);
WEAK void WAKE_EDMA3_CH7_IRQHandler(void);
WEAK void WAKE_ACMP0_IRQHandler(void);
WEAK void WAKE_ACMP1_IRQHandler(void);
WEAK void WAKE_ACMP2_IRQHandler(void);
WEAK void WAKE_ACMP3_IRQHandler(void);
WEAK void WAKE_EWM_IRQHandler(void);
WEAK void WAKE_FREQME_IRQHandler(void);
WEAK void WAKE_LPTMR0_IRQHandler(void);
WEAK void WAKE_LPTMR1_IRQHandler(void);
WEAK void WAKE_QTPM0_IRQHandler(void);
WEAK void WAKE_QTPM1_IRQHandler(void);
WEAK void WAKE_QTPM2_IRQHandler(void);
WEAK void WAKE_QTPM3_IRQHandler(void);
WEAK void WAKE_SWT0_IRQHandler(void);
WEAK void WAKE_SWT1_IRQHandler(void);
WEAK void Reserved246_IRQHandler(void);
WEAK void Reserved247_IRQHandler(void);
WEAK void Reserved248_IRQHandler(void);
WEAK void Reserved249_IRQHandler(void);
WEAK void WAKE_I3C_IRQHandler(void);
WEAK void WAKE_LPI2C0_IRQHandler(void);
WEAK void WAKE_LPI2C1_IRQHandler(void);
WEAK void WAKE_LPSPI_IRQHandler(void);
WEAK void WAKE_LPUART0_IRQHandler(void);
WEAK void WAKE_LPUART1_IRQHandler(void);
WEAK void WAKE_GPIO_CH0_IRQHandler(void);
WEAK void WAKE_GPIO_CH1_IRQHandler(void);
WEAK void WAKE_PDM_EVENT_IRQHandler(void);
WEAK void WAKE_PDM_ERROR_IRQHandler(void);
WEAK void WAKE_PDM_HWVAD_EVENT_IRQHandler(void);
WEAK void WAKE_PDM_HWVAD_ERROR_IRQHandler(void);
WEAK void Reserved262_IRQHandler(void);
WEAK void VBAT_BBSM_INT0_IRQHandler(void);
WEAK void Reserved264_IRQHandler(void);
WEAK void VBAT_TDET_IRQHandler(void);
WEAK void VBAT_LPTMR_IRQHandler(void);
WEAK void VBAT_RTC_IRQHandler(void);
WEAK void VBAT_GPIO_CH0_IRQHandler(void);
WEAK void VBAT_GPIO_CH1_IRQHandler(void);
WEAK void VBAT_VBATCON_IRQHandler(void);
WEAK void AUDIO_TRDC_IRQHandler(void);
WEAK void AUDIO_SAI0_IRQHandler(void);
WEAK void AUDIO_SAI1_IRQHandler(void);
WEAK void AUDIO_SAI2_IRQHandler(void);
WEAK void Reserved275_IRQHandler(void);
WEAK void Reserved276_IRQHandler(void);
WEAK void Reserved277_IRQHandler(void);
WEAK void AUDIO_PDM_EVENT_IRQHandler(void);
WEAK void AUDIO_PDM_ERROR_IRQHandler(void);
WEAK void Reserved280_IRQHandler(void);
WEAK void Reserved281_IRQHandler(void);
WEAK void Reserved282_IRQHandler(void);
WEAK void Reserved283_IRQHandler(void);
WEAK void Reserved284_IRQHandler(void);
WEAK void Reserved285_IRQHandler(void);
WEAK void AUDIO_SPDIF_IRQHandler(void);
WEAK void AUDIO_EDMA3_CH0_IRQHandler(void);
WEAK void AUDIO_EDMA3_CH1_IRQHandler(void);
WEAK void AUDIO_EDMA3_CH2_IRQHandler(void);
WEAK void AUDIO_EDMA3_CH3_IRQHandler(void);
WEAK void AUDIO_EDMA3_CH4_IRQHandler(void);
WEAK void AUDIO_EDMA3_CH5_IRQHandler(void);
WEAK void AUDIO_EDMA3_CH6_IRQHandler(void);
WEAK void AUDIO_EDMA3_CH7_IRQHandler(void);
WEAK void Reserved295_IRQHandler(void);
WEAK void Reserved296_IRQHandler(void);
WEAK void Reserved297_IRQHandler(void);
WEAK void Reserved298_IRQHandler(void);
WEAK void Reserved299_IRQHandler(void);
WEAK void Reserved300_IRQHandler(void);
WEAK void Reserved301_IRQHandler(void);
WEAK void Reserved302_IRQHandler(void);
WEAK void Reserved303_IRQHandler(void);
WEAK void AUDIO_ASRC_IRQHandler(void);
WEAK void AUDIO_FREQME_IRQHandler(void);
WEAK void Reserved306_IRQHandler(void);
WEAK void Reserved307_IRQHandler(void);
WEAK void Reserved308_IRQHandler(void);
WEAK void Reserved309_IRQHandler(void);
WEAK void Reserved310_IRQHandler(void);
WEAK void COMM_TRDC_IRQHandler(void);
WEAK void COMM_ENET_QOS_IRQHandler(void);
WEAK void COMM_ENET_QOS_TX_IRQHandler(void);
WEAK void COMM_ENET_QOS_RX_IRQHandler(void);
WEAK void COMM_ENET_TX_IRQHandler(void);
WEAK void COMM_ENET_RX_IRQHandler(void);
WEAK void COMM_ENET_OTHER_IRQHandler(void);
WEAK void COMM_ENET_1588_IRQHandler(void);
WEAK void COMM_FLEXSPI_SLV_IRQHandler(void);
WEAK void COMM_USB0_IRQHandler(void);
WEAK void COMM_USBPHY_IRQHandler(void);
WEAK void COMM_USB1_IRQHandler(void);
WEAK void COMM_USDHC0_IRQHandler(void);
WEAK void COMM_USDHC1_IRQHandler(void);
WEAK void Reserved325_IRQHandler(void);
WEAK void COMM_TENBASET_PHY0_IRQHandler(void);
WEAK void Reserved327_IRQHandler(void);
WEAK void COMM_TENBASET_PHY1_IRQHandler(void);
WEAK void Reserved329_IRQHandler(void);
WEAK void COMM_FREQME_IRQHandler(void);
WEAK void MEDIA_TRDC_IRQHandler(void);
WEAK void Reserved332_IRQHandler(void);
WEAK void MEDIA_DCIF_CH0_IRQHandler(void);
WEAK void MEDIA_DCIF_CH1_IRQHandler(void);
WEAK void MEDIA_DCIF_CH2_IRQHandler(void);
WEAK void MEDIA_DCIF_CH3_IRQHandler(void);
WEAK void MEDIA_DCIF_CH4_IRQHandler(void);
WEAK void MEDIA_DCIF_CH5_IRQHandler(void);
WEAK void MEDIA_DCIF_CH6_IRQHandler(void);
WEAK void MEDIA_DCIF_CH7_IRQHandler(void);
WEAK void MEDIA_DCIF_CH8_IRQHandler(void);
WEAK void Reserved342_IRQHandler(void);
WEAK void MEDIA_REFORMATTER_IRQHandler(void);
WEAK void MEDIA_ISI_IRQHandler(void);
WEAK void MEDIA_TINGPU_IRQHandler(void);
WEAK void MEDIA_JPEGDEC_IRQHandler(void);
WEAK void Reserved347_IRQHandler(void);
WEAK void Reserved348_IRQHandler(void);
WEAK void MEDIA_FREQME_IRQHandler(void);

