zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2660/startup_MIMXRT2660.c
WEAK void WAKE_LPTMR1_IRQHandler(void)
{
    WAKE_LPTMR1_DriverIRQHandler();
}

WEAK void WAKE_QTPM0_IRQHandler(void)
{
    TPM_DriverIRQHandler(4U);
}

WEAK void WAKE_QTPM1_IRQHandler(void)
{
    TPM_DriverIRQHandler(5U);
}

WEAK void WAKE_QTPM2_IRQHandler(void)
{
    TPM_DriverIRQHandler(6U);
}

WEAK void WAKE_QTPM3_IRQHandler(void)
{
    TPM_DriverIRQHandler(7U);
}

WEAK void WAKE_SWT0_IRQHandler(void)
{
    WAKE_SWT0_DriverIRQHandler();
}

WEAK void WAKE_SWT1_IRQHandler(void)
{
    WAKE_SWT1_DriverIRQHandler();
}

WEAK void Reserved246_IRQHandler(void)
{
    Reserved246_DriverIRQHandler();
}

WEAK void Reserved247_IRQHandler(void)
{
    Reserved247_DriverIRQHandler();
}

WEAK void Reserved248_IRQHandler(void)
{
    Reserved248_DriverIRQHandler();
}

WEAK void Reserved249_IRQHandler(void)
{
    Reserved249_DriverIRQHandler();
}

WEAK void WAKE_I3C_IRQHandler(void)
{
    I3C_DriverIRQHandler(1U);
}

WEAK void WAKE_LPI2C0_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(2U);
}

WEAK void WAKE_LPI2C1_IRQHandler(void)
{
    LPI2C_DriverIRQHandler(3U);
}

WEAK void WAKE_LPSPI_IRQHandler(void)
{
    LPSPI_DriverIRQHandler(5U);
}

WEAK void WAKE_LPUART0_IRQHandler(void)
{
    LPUART_DriverIRQHandler(6U);
}

WEAK void WAKE_LPUART1_IRQHandler(void)
{
    LPUART_DriverIRQHandler(7U);
}

WEAK void WAKE_GPIO_CH0_IRQHandler(void)
{
    WAKE_GPIO_CH0_DriverIRQHandler();
}

WEAK void WAKE_GPIO_CH1_IRQHandler(void)
{
    WAKE_GPIO_CH1_DriverIRQHandler();
}

WEAK void WAKE_PDM_EVENT_IRQHandler(void)
{
    PDM_EventHandleIRQ(1U);
}

WEAK void WAKE_PDM_ERROR_IRQHandler(void)
{
    PDM_ErrorHandleIRQ(1U);
}

WEAK void WAKE_PDM_HWVAD_EVENT_IRQHandler(void)
{
    PDM_HwvadEventHandleIRQ(1U);
}

WEAK void WAKE_PDM_HWVAD_ERROR_IRQHandler(void)
{
    PDM_HwvadErrorHandleIRQ(1U);
}

WEAK void Reserved262_IRQHandler(void)
{
    Reserved262_DriverIRQHandler();
}

WEAK void VBAT_BBSM_INT0_IRQHandler(void)
{
    VBAT_BBSM_INT0_DriverIRQHandler();
}

WEAK void Reserved264_IRQHandler(void)
{
    Reserved264_DriverIRQHandler();
}

WEAK void VBAT_TDET_IRQHandler(void)
{
    VBAT_TDET_DriverIRQHandler();
}

WEAK void VBAT_LPTMR_IRQHandler(void)
{
    VBAT_LPTMR_DriverIRQHandler();
}

WEAK void VBAT_RTC_IRQHandler(void)
{
    VBAT_RTC_DriverIRQHandler();
}

WEAK void VBAT_GPIO_CH0_IRQHandler(void)
{
    VBAT_GPIO_CH0_DriverIRQHandler();
}

WEAK void VBAT_GPIO_CH1_IRQHandler(void)
{
    VBAT_GPIO_CH1_DriverIRQHandler();
}

WEAK void VBAT_VBATCON_IRQHandler(void)
{
    VBAT_VBATCON_DriverIRQHandler();
}

WEAK void AUDIO_TRDC_IRQHandler(void)
{
    AUDIO_TRDC_DriverIRQHandler();
}

WEAK void AUDIO_SAI0_IRQHandler(void)
{
    SAI_DriverIRQHandler(0U);
}

WEAK void AUDIO_SAI1_IRQHandler(void)
{
    SAI_DriverIRQHandler(1U);
}

WEAK void AUDIO_SAI2_IRQHandler(void)
{
    SAI_DriverIRQHandler(2U);
}

WEAK void Reserved275_IRQHandler(void)
{
    Reserved275_DriverIRQHandler();
}

WEAK void Reserved276_IRQHandler(void)
{
    Reserved276_DriverIRQHandler();
}

WEAK void Reserved277_IRQHandler(void)
{
    Reserved277_DriverIRQHandler();
}

WEAK void AUDIO_PDM_EVENT_IRQHandler(void)
{
    PDM_EventHandleIRQ(0U);
}

WEAK void AUDIO_PDM_ERROR_IRQHandler(void)
{
    PDM_ErrorHandleIRQ(0U);
}

WEAK void Reserved280_IRQHandler(void)
{
    Reserved280_DriverIRQHandler();
}

WEAK void Reserved281_IRQHandler(void)
{
    Reserved281_DriverIRQHandler();
}

WEAK void Reserved282_IRQHandler(void)
{
    Reserved282_DriverIRQHandler();
}

WEAK void Reserved283_IRQHandler(void)
{
    Reserved283_DriverIRQHandler();
}

WEAK void Reserved284_IRQHandler(void)
{
    Reserved284_DriverIRQHandler();
}

WEAK void Reserved285_IRQHandler(void)
{
    Reserved285_DriverIRQHandler();
}

WEAK void AUDIO_SPDIF_IRQHandler(void)
{
    AUDIO_SPDIF_DriverIRQHandler();
}

WEAK void AUDIO_EDMA3_CH0_IRQHandler(void)
{
    EDMA_DriverIRQHandler(2U, 0U);
}

WEAK void AUDIO_EDMA3_CH1_IRQHandler(void)
{
    EDMA_DriverIRQHandler(2U, 1U);
}

WEAK void AUDIO_EDMA3_CH2_IRQHandler(void)
{
    EDMA_DriverIRQHandler(2U, 2U);
}

WEAK void AUDIO_EDMA3_CH3_IRQHandler(void)
{
    EDMA_DriverIRQHandler(2U, 3U);
}

WEAK void AUDIO_EDMA3_CH4_IRQHandler(void)
{
    EDMA_DriverIRQHandler(2U, 4U);
}

WEAK void AUDIO_EDMA3_CH5_IRQHandler(void)
{
    EDMA_DriverIRQHandler(2U, 5U);
}

WEAK void AUDIO_EDMA3_CH6_IRQHandler(void)
{
    EDMA_DriverIRQHandler(2U, 6U);
}

WEAK void AUDIO_EDMA3_CH7_IRQHandler(void)
{
    EDMA_DriverIRQHandler(2U, 7U);
}

WEAK void Reserved295_IRQHandler(void)
{
    Reserved295_DriverIRQHandler();
}

WEAK void Reserved296_IRQHandler(void)
{
    Reserved296_DriverIRQHandler();
}

WEAK void Reserved297_IRQHandler(void)
{
    Reserved297_DriverIRQHandler();
}

WEAK void Reserved298_IRQHandler(void)
{
    Reserved298_DriverIRQHandler();
}

WEAK void Reserved299_IRQHandler(void)
{
    Reserved299_DriverIRQHandler();
}

WEAK void Reserved300_IRQHandler(void)
{
    Reserved300_DriverIRQHandler();
}

WEAK void Reserved301_IRQHandler(void)
{
    Reserved301_DriverIRQHandler();
}

WEAK void Reserved302_IRQHandler(void)
{
    Reserved302_DriverIRQHandler();
}

WEAK void Reserved303_IRQHandler(void)
{
    Reserved303_DriverIRQHandler();
}

WEAK void AUDIO_ASRC_IRQHandler(void)
{
    ASRC_CommonDriverIRQHandler(0U);
}

WEAK void AUDIO_FREQME_IRQHandler(void)
{
    AUDIO_FREQME_DriverIRQHandler();
}

WEAK void Reserved306_IRQHandler(void)
{
    Reserved306_DriverIRQHandler();
}

WEAK void Reserved307_IRQHandler(void)
{
    Reserved307_DriverIRQHandler();
}

WEAK void Reserved308_IRQHandler(void)
{
    Reserved308_DriverIRQHandler();
}

WEAK void Reserved309_IRQHandler(void)
{
    Reserved309_DriverIRQHandler();
}

WEAK void Reserved310_IRQHandler(void)
{
    Reserved310_DriverIRQHandler();
}

WEAK void COMM_TRDC_IRQHandler(void)
{
    COMM_TRDC_DriverIRQHandler();
}

WEAK void COMM_ENET_QOS_IRQHandler(void)
{
    COMM_ENET_QOS_DriverIRQHandler();
}

WEAK void COMM_ENET_QOS_TX_IRQHandler(void)
{
    COMM_ENET_QOS_TX_DriverIRQHandler();
}

WEAK void COMM_ENET_QOS_RX_IRQHandler(void)
{
    COMM_ENET_QOS_RX_DriverIRQHandler();
}

WEAK void COMM_ENET_TX_IRQHandler(void)
{
    ENET_CommonFrame0DriverIRQHandler(0U);
}

